Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExactSpacing.Element Structure
 This structure is used to hold number and distance data.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public struct Element
<SerializableAttribute>
Public Structure Element
The RebarSpacing.ExactSpacing.Element type exposes the following members.
Constructors
Name | Description
RebarSpacing.ExactSpacing.Element
 Initializes a new instance of the RebarSpacing.ExactSpacing.Element struct.
Top
Properties
Name | Description
Distance
 Gets or sets the spacing distance in the element.
Number
 Gets or sets the number of spaces in the element.
Top
See Also
Reference
Tekla.Structures.Model Namespace